相邻重复数组里面找出现一次的数字，要求时间复杂度优于O(n)
硬币组合数，第一个缺失正数，如何实现url去重数据结构 三题选一题做
算法题：链表右移K位
题目：中文转阿拉伯数字 “一千三百五十七亿六千零八万三千四百二十五”
做题，第一题，二叉树最近公共祖先
补：函数栈应该是什么样的，空间复杂度是O(n)吗
第二题，二叉树最大路径和（lc 124）

聊项目
限流算法有哪些，令牌桶算法精度如何
redis 数据结构有哪些
TCP和UDP区别
内存对齐是什么意思？数组是先写行和先写列有什么区别（C语言，与我无瓜）
排序算法各种追问（排序算法这一块真的要熟悉，这个不会感觉就没了）
千万高考学生成绩排序



漏桶算法，虽然自己知道，但是还是没背好讲起来比较费力
为什么这个项目用到redis，redis除了用在这方面还用在什么方面吗？
为什么redis快
谈谈redis的io多路复用
redis数据结构
System.out.println输出到屏幕过程中操作系统级别发生了什么事情？这题没答好，我只知道java发生了什么事情。
什么是虚拟内存（进程什么情况下会阻塞），共享内存，驻存内存
linux下如何使用共享内存 GG
一百万整数如何寻找中位数 优于nlgn
自己如何实现map结构



介绍项目
详细介绍一下漏桶算法如何实现
介绍hashmap数据结构
hashmap是线程安全的吗？扩容的时候线程安全，插入的时候线程不安全
hashmap最坏时间复杂度？O(n)，佛了面试官质疑了一下我，然后我就改口o(1)了
loadfactor是什么？为什么设置成0.75
红黑树最常用的操作，红黑树的限制是什么？（谁能背着色限制枯了）
数据库平时用哪些？（redis,mysql）
数据库ACID是什么
mysql是如何实现持久性的？（不会）
在分布式数据库下ACID还能保持吗（不会，我答不能，需要分布式事务锁）
听说过CAP吗？（听说过，但只记得三者无法同时满足）
tcp time_wait状态是在客户端还是服务端，怎么产生的？
问我研究生学了什么课程？我说研究生学的是更抽象的软件工程，敏捷项目管理，没有数据库和计算机网络这些基础课程。(大误，不应该这样说)
然后就问Sprint backlog是什么？我答了一个看板的概念，算一丢丢对吧
面向对象三大特性
开闭原则，可以举java里面用到的几个例子吗？
DecoratorPattern是什么？（我知道是装饰器模式，但忘了）
proxtPattern是什么？
进程通信的方式
socket和管道异同点？（不会）
进程阻塞拿到数据后可以马上运行吗？
进程调度有什么算法？
抢占式和非抢占式算法区别？
非抢占式算法可能会饿死，如何解决？
聊了一下自己的美赛，描述一下用的元胞自动机算法
启发式搜索算法有什么缺点？
自己学业怎么打算，读不读博
三句话描述一下自己的优缺点



链表判断是否有环
链表环节点，如何证明
你在微信实习，有了解过微信的消息系统是怎么实现的吗？（这是问实习生的问题？）
微信的撤回功能怎么做的
如何实现企业微信消息动态修改？（问这个问题前还特意问你用过这个功能吗？我说没用过，没用过正好想想，我？？？）
你有什么优势？
在微信这边转正怎么样

tcp accept命令是什么？不会（就没问网络了
线程和进程区别
redis为什么快
多路复用（epollwait函数会不会影响别的进程？）
rediszset的数据结构
hashmap数据结构
为什么大于八
concurrenthashmap为什么线程安全
synchronize是可重入的吗？如何实现可重入？
垃圾回收算法
为什么要有两个surviror区
CMS产生内存碎片怎么办
介绍一下CAS，会有什么问题
类加载器机制。双亲委派好处



项目：什么是rpc，为什么写这个项目

net/rpc和你这个rpc有什么区别

说一下go语言的反射和空接口的底层是什么。

http状态码？

http和tcp有什么区别？

tcp三次握手

tcp三次握手的过程里，go语言的socket是什么表现？

你觉得，Accept()以后立刻就可以连接完成吗？（全连接队列）

线程调度发生了什么？

进程和线程的区别？





